package com.ingot.cloud.pms.api.constants;


/**
 * <p>Description  : UcResponseCode.</p>
 * <p>Author       : wangchao.</p>
 * <p>Date         : 2018/9/26.</p>
 * <p>Time         : 下午3:55.</p>
 */
public enum PmsResponseCode {
    PMS20010001(20010001, "用户名已存在"),
    PMS20010002(20010002, "用户名或密码不正确"),
    PMS20010003(20010003, "用户名不能为空"),
    PMS20010004(20010004, "用户 token 更新异常"),
    PMS20010005(20010005, "用户不可用，请联系客服"),
    PMS20010006(20010006, "原始密码输入错误"),
    PMS20010007(20010007, "新密码和原始密码不能相同"),
    PMS20010008(20010008, "用户不存在"),
    PMS20010009(20010009, "部门不存在"),
    PMS20010010(20010010, "只能删除叶子组织"),
    PMS20010012(20010012, "角色用户绑定失败"),
    PMS20010013(20010013, "角色菜单绑定失败"),
    PMS20010014(20010014, "该部门已绑定用户，不可删除"),
    PMS20010015(20010015, "菜单不存在"),
    PMS20010016(20010016, "只能删除叶子菜单"),
    PMS20010017(20010017, "该菜单已绑定角色，不可删除"),
    PMS20010018(20010018, "权限不存在"),
    PMS20010019(20010019, "菜单系统绑定失败"),
    PMS20010020(20010020, "系统不存在"),
    PMS20010021(20010021, "只能删除叶子权限"),
    PMS20010022(20010022, "该手机号已使用"),
    PMS20010023(20010023, "该手机号未注册"),
    PMS20010024(20010024, "角色不存在"),

    PMS20011000(20011000, "该菜单已绑定Client，不可删除"),
    PMS20011001(20011001, "该角色已绑定管理员，不可删除"),
    PMS20011002(20011002, "该角色已绑定App用户，不可删除"),
    PMS20011004(20011004, "该角色已绑定权限，不可删除"),
    PMS20011005(20011005, "该角色已绑定菜单，不可删除"),
    PMS20011006(20011006, "该角色已绑定Client，不可删除"),
    PMS20011010(20011010, "超管角色不可禁用"),
    PMS20011011(20011011, "超管角色不可删除"),
    PMS20011100(20011100, "该Client已绑定菜单，不可删除"),
    PMS20011101(20011101, "该Client已绑定角色，不可删除"),
    PMS20011400(20011400, "该权限已绑定角色，不可删除"),
    PMS20012000(20012000, "租户不存在"),

    PMS20020000(20020000, "Client不存在"),
    PMS20020001(20020001, "用户无法登录该Client");

    private int code;
    private String msg;

    /**
     * Code int.
     */
    public int code() {
        return code;
    }

    /**
     * Message.
     */
    public String message() {
        return msg;
    }

    /**
     * Code string.
     */
    public String codeString() {
        return code() + "";
    }

    PmsResponseCode(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }
}
